simulations/test_box/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hull.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    subsetFeatures
    {
        nonManifoldEdges      no;
        openEdges             yes;
    }

    writeObj            yes;
}

// ************************************************************************* //
